Repository: Unixcision/uniconnect
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.help.ssh
source: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Create a new workspace, mark it as remote-SSH, and start an SSH session in that workspace. cmux will also establish a local SSH proxy endpoint so browser traffic can egress from the remote host. Flags: --name <title> Optional workspace title --port <n> SSH port --identity <path> SSH identity file path -A, --forward-agent Forward the caller's SSH agent; also honors ForwardAgent yes from ssh_config -a, --no-forward-agent Disable SSH agent forwarding for this workspace --ssh-option <opt> Extra SSH -o option (repeatable) --window <id|ref|index> Target window for the managed workspace --no-focus Create workspace without switching to it Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
ar: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] أنشئ مساحة عمل جديدة، وعلّمها كـ remote-SSH، وابدأ جلسة SSH داخلها. سينشئ UniConnect أيضًا نقطة نهاية وكيل SSH محلية حتى تخرج حركة مرور المتصفح من المضيف البعيد. Flags: --name <title> عنوان اختياري لمساحة العمل --port <n> منفذ SSH --identity <path> مسار ملف هوية SSH -A, --forward-agent يمرر وكيل SSH الخاص بالمستدعي؛ ويحترم أيضًا ForwardAgent yes من ssh_config -a, --no-forward-agent يعطّل تمرير وكيل SSH لمساحة العمل هذه --ssh-option <opt> خيار SSH -o إضافي (قابل للتكرار) --window <id|ref|index> النافذة الهدف لمساحة العمل المُدارة --no-focus ينشئ مساحة العمل من دون الانتقال إليها Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
bs: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Kreira novi workspace, označava ga kao remote-SSH i pokreće SSH sesiju u tom workspaceu. cmux će također uspostaviti lokalnu SSH proxy krajnju tačku kako bi promet preglednika izlazio s udaljenog hosta. Flags: --name <title> Opcionalni naslov workspacea --port <n> SSH port --identity <path> Putanja do SSH identity datoteke -A, --forward-agent Prosljeđuje SSH agent pozivaoca; poštuje i ForwardAgent yes iz ssh_config -a, --no-forward-agent Onemogućava prosljeđivanje SSH agenta za ovaj workspace --ssh-option <opt> Dodatna SSH -o opcija (može se ponavljati) --window <id|ref|index> Ciljni prozor za upravljani workspace --no-focus Kreira workspace bez prelaska na njega Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
da: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Opret et nyt arbejdsområde, markér det som remote-SSH, og start en SSH-session i det arbejdsområde. cmux opretter også et lokalt SSH-proxyendepunkt, så browsertrafik kan gå ud fra den eksterne vært. Flags: --name <title> Valgfri titel på arbejdsområdet --port <n> SSH-port --identity <path> Sti til SSH-identitetsfil -A, --forward-agent Videresend kalderens SSH-agent; respekterer også ForwardAgent yes fra ssh_config -a, --no-forward-agent Deaktiver SSH-agentvideresendelse for dette arbejdsområde --ssh-option <opt> Ekstra SSH -o-indstilling (kan gentages) --window <id|ref|index> Målvindue for det administrerede arbejdsområde --no-focus Opret arbejdsområdet uden at skifte til det Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
de: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Erstellt einen neuen Workspace, markiert ihn als remote-SSH und startet darin eine SSH-Sitzung. cmux richtet außerdem einen lokalen SSH-Proxy-Endpunkt ein, damit Browserverkehr vom Remote-Host ausgeht. Flags: --name <title> Optionaler Workspace-Titel --port <n> SSH-Port --identity <path> Pfad zur SSH-Identitätsdatei -A, --forward-agent Leitet den SSH-Agent des Aufrufers weiter; beachtet auch ForwardAgent yes aus ssh_config -a, --no-forward-agent Deaktiviert SSH-Agent-Weiterleitung für diesen Workspace --ssh-option <opt> Zusätzliche SSH-Option -o (wiederholbar) --window <id|ref|index> Zielfenster für den verwalteten Workspace --no-focus Workspace erstellen, ohne zu ihm zu wechseln Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
es: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Crea un nuevo espacio de trabajo, márcalo como remote-SSH e inicia una sesión SSH en ese espacio. cmux también establecerá un punto final de proxy SSH local para que el tráfico del navegador salga desde el host remoto. Flags: --name <title> Título opcional del espacio de trabajo --port <n> Puerto SSH --identity <path> Ruta del archivo de identidad SSH -A, --forward-agent Reenvía el agente SSH del proceso que llama; también respeta ForwardAgent yes de ssh_config -a, --no-forward-agent Desactiva el reenvío del agente SSH para este espacio de trabajo --ssh-option <opt> Opción SSH -o adicional (repetible) --window <id|ref|index> Ventana de destino para el espacio de trabajo administrado --no-focus Crea el espacio de trabajo sin cambiar a él Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
fr: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Crée un nouvel espace de travail, le marque comme remote-SSH et démarre une session SSH dans cet espace. cmux établira aussi un point de terminaison proxy SSH local afin que le trafic du navigateur sorte depuis l’hôte distant. Flags: --name <title> Titre facultatif de l’espace de travail --port <n> Port SSH --identity <path> Chemin du fichier d’identité SSH -A, --forward-agent Transfère l’agent SSH de l’appelant ; respecte aussi ForwardAgent yes depuis ssh_config -a, --no-forward-agent Désactive le transfert d’agent SSH pour cet espace de travail --ssh-option <opt> Option SSH -o supplémentaire (répétable) --window <id|ref|index> Fenêtre cible pour l’espace de travail géré --no-focus Crée l’espace de travail sans basculer dessus Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
it: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Crea un nuovo workspace, contrassegnalo come remote-SSH e avvia una sessione SSH in quel workspace. cmux creerà anche un endpoint proxy SSH locale in modo che il traffico del browser esca dall'host remoto. Flags: --name <title> Titolo opzionale del workspace --port <n> Porta SSH --identity <path> Percorso del file di identità SSH -A, --forward-agent Inoltra l'agente SSH del chiamante; rispetta anche ForwardAgent yes da ssh_config -a, --no-forward-agent Disattiva l'inoltro dell'agente SSH per questo workspace --ssh-option <opt> Opzione SSH -o aggiuntiva (ripetibile) --window <id|ref|index> Finestra di destinazione per il workspace gestito --no-focus Crea il workspace senza passarvi Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
ja: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] 新しいワークスペースを作成し、remote-SSH としてマークして、そのワークスペースで SSH セッションを開始します。 UniConnect はローカル SSH プロキシエンドポイントも確立するため、ブラウザトラフィックはリモートホストから送信されます。 Flags: --name <title> 任意のワークスペースタイトル --port <n> SSH ポート --identity <path> SSH identity ファイルパス -A, --forward-agent 呼び出し元の SSH エージェントを転送します。ssh_config の ForwardAgent yes も尊重します -a, --no-forward-agent このワークスペースでは SSH エージェント転送を無効にします --ssh-option <opt> 追加の SSH -o オプション（繰り返し可） --window <id|ref|index> 管理対象ワークスペースのターゲットウィンドウ --no-focus ワークスペースを作成しますが切り替えません Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
km: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] បង្កើត workspace ថ្មី សម្គាល់វាជា remote-SSH ហើយចាប់ផ្តើមសម័យ SSH នៅក្នុង workspace នោះ។ UniConnect ក៏នឹងបង្កើតចំណុចបញ្ចប់ SSH proxy មូលដ្ឋាន ដើម្បីឱ្យចរាចរណ៍ browser ចេញពី host ពីចម្ងាយ។ Flags: --name <title> ចំណងជើង workspace ស្រេចចិត្ត --port <n> ច្រក SSH --identity <path> ផ្លូវឯកសារ SSH identity -A, --forward-agent បញ្ជូនបន្ត SSH agent របស់អ្នកហៅ; ក៏គោរព ForwardAgent yes ពី ssh_config -a, --no-forward-agent បិទការបញ្ជូនបន្ត SSH agent សម្រាប់ workspace នេះ --ssh-option <opt> ជម្រើស SSH -o បន្ថែម (អាចប្រើម្តងហើយម្តងទៀត) --window <id|ref|index> បង្អួចគោលដៅសម្រាប់ workspace ដែលបានគ្រប់គ្រង --no-focus បង្កើត workspace ដោយមិនប្តូរទៅវា Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
ko: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] 새 워크스페이스를 만들고 remote-SSH로 표시한 뒤, 그 워크스페이스에서 SSH 세션을 시작합니다. cmux는 브라우저 트래픽이 원격 호스트에서 나가도록 로컬 SSH 프록시 엔드포인트도 설정합니다. Flags: --name <title> 선택적 워크스페이스 제목 --port <n> SSH 포트 --identity <path> SSH identity 파일 경로 -A, --forward-agent 호출자의 SSH 에이전트를 전달합니다. ssh_config의 ForwardAgent yes도 존중합니다 -a, --no-forward-agent 이 워크스페이스에서 SSH 에이전트 전달을 비활성화합니다 --ssh-option <opt> 추가 SSH -o 옵션(반복 가능) --window <id|ref|index> 관리되는 워크스페이스의 대상 창 --no-focus 워크스페이스를 만들되 전환하지 않습니다 Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
nb: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Opprett et nytt arbeidsområde, merk det som remote-SSH, og start en SSH-økt i arbeidsområdet. cmux oppretter også et lokalt SSH-proxyendepunkt slik at nettlesertrafikk kan gå ut fra den eksterne verten. Flags: --name <title> Valgfri tittel på arbeidsområdet --port <n> SSH-port --identity <path> Sti til SSH-identitetsfil -A, --forward-agent Videresender innkallerens SSH-agent; respekterer også ForwardAgent yes fra ssh_config -a, --no-forward-agent Deaktiver SSH-agentvideresending for dette arbeidsområdet --ssh-option <opt> Ekstra SSH -o-alternativ (kan gjentas) --window <id|ref|index> Målvindu for det administrerte arbeidsområdet --no-focus Opprett arbeidsområdet uten å bytte til det Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
pl: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Utwórz nowy workspace, oznacz go jako remote-SSH i uruchom w nim sesję SSH. cmux utworzy także lokalny punkt końcowy proxy SSH, aby ruch przeglądarki wychodził ze zdalnego hosta. Flags: --name <title> Opcjonalny tytuł workspace --port <n> Port SSH --identity <path> Ścieżka pliku tożsamości SSH -A, --forward-agent Przekazuje agenta SSH wywołującego; respektuje też ForwardAgent yes z ssh_config -a, --no-forward-agent Wyłącza przekazywanie agenta SSH dla tego workspace --ssh-option <opt> Dodatkowa opcja SSH -o (można powtarzać) --window <id|ref|index> Okno docelowe dla zarządzanego workspace --no-focus Tworzy workspace bez przełączania się do niego Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
pt_br: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Crie um novo workspace, marque-o como remote-SSH e inicie uma sessão SSH nesse workspace. O UniConnect também estabelecerá um endpoint de proxy SSH local para que o tráfego do navegador saia pelo host remoto. Flags: --name <title> Título opcional do workspace --port <n> Porta SSH --identity <path> Caminho do arquivo de identidade SSH -A, --forward-agent Encaminha o agente SSH do chamador; também respeita ForwardAgent yes do ssh_config -a, --no-forward-agent Desativa o encaminhamento do agente SSH para este workspace --ssh-option <opt> Opção SSH -o extra (repetível) --window <id|ref|index> Janela de destino para o workspace gerenciado --no-focus Cria o workspace sem alternar para ele Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
ru: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Создает новый workspace, помечает его как remote-SSH и запускает в нем SSH-сеанс. cmux также создаст локальную конечную точку SSH-прокси, чтобы трафик браузера выходил с удаленного хоста. Flags: --name <title> Необязательный заголовок workspace --port <n> SSH-порт --identity <path> Путь к файлу идентификации SSH -A, --forward-agent Пересылает SSH-агент вызывающего процесса; также учитывает ForwardAgent yes из ssh_config -a, --no-forward-agent Отключает пересылку SSH-агента для этого workspace --ssh-option <opt> Дополнительная опция SSH -o (можно повторять) --window <id|ref|index> Целевое окно для управляемого workspace --no-focus Создает workspace без переключения на него Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
th: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] สร้าง workspace ใหม่ ทำเครื่องหมายเป็น remote-SSH และเริ่มเซสชัน SSH ใน workspace นั้น UniConnect จะตั้งค่าปลายทาง SSH proxy ภายในเครื่องด้วย เพื่อให้ทราฟฟิกของเบราว์เซอร์ออกจากโฮสต์ระยะไกล Flags: --name <title> ชื่อ workspace ที่ระบุได้ --port <n> พอร์ต SSH --identity <path> พาธไฟล์ SSH identity -A, --forward-agent ส่งต่อ SSH agent ของผู้เรียก และเคารพ ForwardAgent yes จาก ssh_config ด้วย -a, --no-forward-agent ปิดการส่งต่อ SSH agent สำหรับ workspace นี้ --ssh-option <opt> ตัวเลือก SSH -o เพิ่มเติม (ระบุซ้ำได้) --window <id|ref|index> หน้าต่างเป้าหมายสำหรับ workspace ที่จัดการ --no-focus สร้าง workspace โดยไม่สลับไปยัง workspace นั้น Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
tr: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Yeni bir workspace oluşturur, onu remote-SSH olarak işaretler ve bu workspace içinde bir SSH oturumu başlatır. cmux ayrıca tarayıcı trafiğinin uzak hosttan çıkabilmesi için yerel bir SSH proxy uç noktası kurar. Flags: --name <title> İsteğe bağlı workspace başlığı --port <n> SSH portu --identity <path> SSH identity dosya yolu -A, --forward-agent Çağıranın SSH agent'ını iletir; ssh_config içindeki ForwardAgent yes ayarını da dikkate alır -a, --no-forward-agent Bu workspace için SSH agent iletmeyi devre dışı bırakır --ssh-option <opt> Ek SSH -o seçeneği (tekrarlanabilir) --window <id|ref|index> Yönetilen workspace için hedef pencere --no-focus Workspace'i ona geçmeden oluşturur Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
uk: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] Створює новий workspace, позначає його як remote-SSH і запускає в ньому SSH-сеанс. cmux також створить локальну кінцеву точку SSH-проксі, щоб трафік браузера виходив із віддаленого хоста. Flags: --name <title> Необов’язкова назва workspace --port <n> SSH-порт --identity <path> Шлях до файлу ідентифікації SSH -A, --forward-agent Пересилає SSH-агент процесу-викликача; також враховує ForwardAgent yes із ssh_config -a, --no-forward-agent Вимикає пересилання SSH-агента для цього workspace --ssh-option <opt> Додаткова опція SSH -o (можна повторювати) --window <id|ref|index> Цільове вікно для керованого workspace --no-focus Створює workspace без перемикання на нього Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
zh_hans: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] 创建一个新工作区，将其标记为 remote-SSH，并在该工作区中启动 SSH 会话。 UniConnect 还会建立本地 SSH 代理端点，使浏览器流量可以从远程主机发出。 Flags: --name <title> 可选的工作区标题 --port <n> SSH 端口 --identity <path> SSH identity 文件路径 -A, --forward-agent 转发调用方的 SSH agent；也会遵循 ssh_config 中的 ForwardAgent yes -a, --no-forward-agent 为此工作区禁用 SSH agent 转发 --ssh-option <opt> 额外的 SSH -o 选项（可重复） --window <id|ref|index> 托管工作区的目标窗口 --no-focus 创建工作区但不切换到它 Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no
zh_hant: Usage: cmux ssh <destination> [flags] [-- <remote-command-args>] 建立新的工作區，將其標記為 remote-SSH，並在該工作區中啟動 SSH 工作階段。 UniConnect 也會建立本機 SSH 代理端點，讓瀏覽器流量可以從遠端主機送出。 Flags: --name <title> 選用的工作區標題 --port <n> SSH 連接埠 --identity <path> SSH identity 檔案路徑 -A, --forward-agent 轉送呼叫端的 SSH agent；也會遵循 ssh_config 中的 ForwardAgent yes -a, --no-forward-agent 對此工作區停用 SSH agent 轉送 --ssh-option <opt> 額外的 SSH -o 選項（可重複） --window <id|ref|index> 受管理工作區的目標視窗 --no-focus 建立工作區但不切換到該工作區 Example: cmux ssh dev@my-host cmux ssh dev@my-host --name "gpu-box" --port 2222 --identity ~/.ssh/id_ed25519 cmux ssh dev@my-host --forward-agent cmux ssh dev@my-host --ssh-option UserKnownHostsFile=/dev/null --ssh-option StrictHostKeyChecking=no

# socket.workspace.unsupportedWindowParam
source: Unsupported parameter `window`; use `window_id` with a window UUID or ref from `window.list`.
ar: المعامل `window` غير مدعوم؛ استخدم `window_id` مع UUID للنافذة أو مرجع من `window.list`.
bs: Parametar `window` nije podržan; koristite `window_id` s UUID-om prozora ili referencom iz `window.list`.
da: Parameteren `window` understøttes ikke; brug `window_id` med et vindues-UUID eller en reference fra `window.list`.
de: Nicht unterstützter Parameter `window`; verwenden Sie `window_id` mit einer Fenster-UUID oder Referenz aus `window.list`.
es: Parámetro `window` no admitido; usa `window_id` con un UUID de ventana o una referencia de `window.list`.
fr: Paramètre `window` non pris en charge; utilisez `window_id` avec un UUID de fenêtre ou une référence de `window.list`.
it: Parametro `window` non supportato; usa `window_id` con un UUID finestra o un riferimento da `window.list`.
ja: サポートされていないパラメータ `window` です。`window.list` のウィンドウ UUID または参照を指定して `window_id` を使用してください。
km: ប៉ារ៉ាម៉ែត្រ `window` មិនត្រូវបានគាំទ្រទេ; ប្រើ `window_id` ជាមួយ UUID របស់បង្អួច ឬការយោងពី `window.list`។
ko: 지원되지 않는 매개변수 `window`입니다. `window.list`의 창 UUID 또는 참조와 함께 `window_id`를 사용하세요.
nb: Parameteren `window` støttes ikke; bruk `window_id` med en vindus-UUID eller referanse fra `window.list`.
pl: Parametr `window` nie jest obsługiwany; użyj `window_id` z UUID okna lub odwołaniem z `window.list`.
pt_br: Parâmetro `window` sem suporte; use `window_id` com um UUID de janela ou referência de `window.list`.
ru: Параметр `window` не поддерживается; используйте `window_id` с UUID окна или ссылкой из `window.list`.
th: ไม่รองรับพารามิเตอร์ `window`; ใช้ `window_id` พร้อม UUID ของหน้าต่างหรือการอ้างอิงจาก `window.list`
tr: `window` parametresi desteklenmiyor; `window_id` değerini `window.list` içindeki bir pencere UUID'si veya başvuruyla kullanın.
uk: Параметр `window` не підтримується; використовуйте `window_id` з UUID вікна або посиланням із `window.list`.
zh_hans: 不支持参数 `window`；请使用 `window_id`，并传入来自 `window.list` 的窗口 UUID 或引用。
zh_hant: 不支援參數 `window`；請使用 `window_id`，並傳入來自 `window.list` 的視窗 UUID 或參照。

# command.toggleLeftSidebar.title
source: Toggle Left Sidebar
ar: تبديل الشريط الجانبي الأيسر
bs: Prebaci lijevu bočnu traku
da: Slå venstre sidebjælke til/fra
de: Linke Seitenleiste ein-/ausblenden
es: Alternar barra lateral izquierda
fr: Afficher/masquer la barre latérale gauche
it: Attiva/Disattiva barra laterale sinistra
ja: 左サイドバーを切り替え
ko: 왼쪽 사이드바 전환
nb: Slå venstre sidepanel av/på
pl: Przełącz lewy pasek boczny
pt_br: Alternar barra lateral esquerda
ru: Переключить левую боковую панель
th: สลับแถบด้านข้างซ้าย
tr: Sol Kenar Çubuğunu Aç/Kapat
uk: Перемкнути ліву бічну панель
zh_hans: 切换左侧边栏
zh_hant: 切換左側邊欄

# menu.view.toggleLeftSidebar
source: Toggle Left Sidebar
ar: تبديل الشريط الجانبي الأيسر
bs: Prebaci lijevu bočnu traku
da: Slå venstre sidebjælke til/fra
de: Linke Seitenleiste ein-/ausblenden
es: Alternar barra lateral izquierda
fr: Afficher/masquer la barre latérale gauche
it: Attiva/Disattiva barra laterale sinistra
ja: 左サイドバーを切り替え
ko: 왼쪽 사이드바 전환
nb: Slå venstre sidepanel av/på
pl: Przełącz lewy pasek boczny
pt_br: Alternar barra lateral esquerda
ru: Переключить левую боковую панель
th: สลับแถบด้านข้างซ้าย
tr: Sol Kenar Çubuğunu Aç/Kapat
uk: Перемкнути ліву бічну панель
zh_hans: 切换左侧边栏
zh_hant: 切換左側邊欄

# menu.view.toggleRightSidebar
source: Toggle Right Sidebar
ar: تبديل الشريط الجانبي الأيمن
bs: Prebaci desnu bočnu traku
da: Slå højre sidebjælke til/fra
de: Rechte Seitenleiste ein-/ausblenden
es: Alternar barra lateral derecha
fr: Afficher/masquer la barre latérale droite
it: Attiva/Disattiva barra laterale destra
ja: 右サイドバーを切り替え
ko: 오른쪽 사이드바 전환
nb: Slå høyre sidepanel av/på
pl: Przełącz prawy pasek boczny
pt_br: Alternar barra lateral direita
ru: Переключить правую боковую панель
th: สลับแถบด้านข้างขวา
tr: Sağ Kenar Çubuğunu Aç/Kapat
uk: Перемкнути праву бічну панель
zh_hans: 切换右侧边栏
zh_hant: 切換右側邊欄

# shortcut.toggleLeftSidebar.label
source: Compact or Expand Sidebar
ar: تبديل الشريط الجانبي الأيسر
bs: Prebaci lijevu bočnu traku
da: Slå venstre sidebjælke til/fra
de: Linke Seitenleiste ein-/ausblenden
es: Compactar o expandir barra lateral
fr: Afficher/masquer la barre latérale gauche
it: Attiva/Disattiva barra laterale sinistra
ja: サイドバーをコンパクト表示または展開
km: បង្រួម ឬពង្រីករបារចំហៀង
ko: 왼쪽 사이드바 전환
nb: Slå venstre sidepanel av/på
pl: Przełącz lewy pasek boczny
pt_br: Alternar barra lateral esquerda
ru: Переключить левую боковую панель
th: สลับแถบด้านข้างซ้าย
tr: Sol Kenar Çubuğunu Aç/Kapat
uk: Перемкнути ліву бічну панель
zh_hans: 切换左侧边栏
zh_hant: 切換左側邊欄
